Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_tim1.h
/*
SPDX-License-Identifier: MIT
SPDX-FileCopyrightText: 2025-2026 Edo. Franzi
*/

/*
; stm32U5Gx_tim1.
; ===============

;------------------------------------------------------------------------
; Author:   Generated using the .svd description    The 2025-01-01
; Modifs:
;
; Project:  uKOS-X
; Goal:     stm32U5Gx_tim1 equates.
;
;   (c) 2025-2026, Edo. Franzi
;   --------------------------
;------------------------------------------------------------------------
*/

#pragma once

#include    <stdint.h>

// TIM1 address definitions
// ------------------------

typedef struct {
    volatile    uint32_t    CR1;
    volatile    uint32_t    CR2;
    volatile    uint32_t    SMCR;
    volatile    uint32_t    DIER;
    volatile    uint32_t    SR;
    volatile    uint32_t    EGR;
    volatile    uint32_t    CCMR1;
    volatile    uint32_t    CCMR2;
    volatile    uint32_t    CCER;
    volatile    uint32_t    CNT;
    volatile    uint32_t    PSC;
    volatile    uint32_t    ARR;
    volatile    uint32_t    RCR;
    volatile    uint32_t    CCR1;
    volatile    uint32_t    CCR2;
    volatile    uint32_t    CCR3;
    volatile    uint32_t    CCR4;
    volatile    uint32_t    BDTR;
    volatile    uint32_t    CCR5;
    volatile    uint32_t    CCR6;
    volatile    uint32_t    CCMR3;
    volatile    uint32_t    DTR2;
    volatile    uint32_t    ECR;
    volatile    uint32_t    TISEL;
    volatile    uint32_t    AF1;
    volatile    uint32_t    AF2;
    volatile    uint32_t    RESERVED0[221];
    volatile    uint32_t    DCR;
    volatile    uint32_t    DMAR;
} TIM1_TypeDef;

#ifdef __cplusplus
#define TIM1_NS reinterpret_cast<TIM1_TypeDef *>(0x40012C00U)
#define TIM1_S  reinterpret_cast<TIM1_TypeDef *>(0x50012C00U)

#else
#define TIM1_NS ((TIM1_TypeDef *)0x40012C00U)
#define TIM1_S  ((TIM1_TypeDef *)0x50012C00U)
#endif

// CR1 Configuration

#define TIM1_CR1_CEN            (0x1U<<0)
#define TIM1_CR1_UDIS           (0x1U<<1)
#define TIM1_CR1_URS            (0x1U<<2)
#define TIM1_CR1_OPM            (0x1U<<3)
#define TIM1_CR1_DIR            (0x1U<<4)
#define TIM1_CR1_CMS            (0x3U<<5)
#define TIM1_CR1_CMS_0          (0x1U<<5)
#define TIM1_CR1_ARPE           (0x1U<<7)
#define TIM1_CR1_CKD            (0x3U<<8)
#define TIM1_CR1_CKD_0          (0x1U<<8)
#define TIM1_CR1_UIFREMAP       (0x1U<<11)
#define TIM1_CR1_DITHEN         (0x1U<<12)

// CR2 Configuration

#define TIM1_CR2_CCPC           (0x1U<<0)
#define TIM1_CR2_CCUS           (0x1U<<2)
#define TIM1_CR2_CCDS           (0x1U<<3)
#define TIM1_CR2_MMS0_2         (0x7U<<4)
#define TIM1_CR2_MMS0_2_0       (0x1U<<4)
#define TIM1_CR2_TI1S           (0x1U<<7)
#define TIM1_CR2_OIS1           (0x1U<<8)
#define TIM1_CR2_OIS1N          (0x1U<<9)
#define TIM1_CR2_OIS2           (0x1U<<10)
#define TIM1_CR2_OIS2N          (0x1U<<11)
#define TIM1_CR2_OIS3           (0x1U<<12)
#define TIM1_CR2_OIS3N          (0x1U<<13)
#define TIM1_CR2_OIS4           (0x1U<<14)
#define TIM1_CR2_OIS4N          (0x1U<<15)
#define TIM1_CR2_OIS5           (0x1U<<16)
#define TIM1_CR2_OIS6           (0x1U<<18)
#define TIM1_CR2_MMS2           (0xFU<<20)
#define TIM1_CR2_MMS2_0         (0x1U<<20)
#define TIM1_CR2_MMS_3          (0x1U<<25)

// SMCR Configuration

#define TIM1_SMCR_SMS           (0x7U<<0)
#define TIM1_SMCR_SMS_0         (0x1U<<0)
#define TIM1_SMCR_OCCS          (0x1U<<3)
#define TIM1_SMCR_TS            (0x7U<<4)
#define TIM1_SMCR_TS_0          (0x1U<<4)
#define TIM1_SMCR_MSM           (0x1U<<7)
#define TIM1_SMCR_ETF           (0xFU<<8)
#define TIM1_SMCR_ETF_0         (0x1U<<8)
#define TIM1_SMCR_ETPS          (0x3U<<12)
#define TIM1_SMCR_ETPS_0        (0x1U<<12)
#define TIM1_SMCR_ECE           (0x1U<<14)
#define TIM1_SMCR_ETP           (0x1U<<15)
#define TIM1_SMCR_SMS3_0        (0x1U<<16)
#define TIM1_SMCR_TS4_3         (0x3U<<20)
#define TIM1_SMCR_TS4_3_0       (0x1U<<20)
#define TIM1_SMCR_SMSPE         (0x1U<<24)
#define TIM1_SMCR_SMSPS         (0x1U<<25)

// DIER Configuration

#define TIM1_DIER_UIE           (0x1U<<0)
#define TIM1_DIER_CC1IE         (0x1U<<1)
#define TIM1_DIER_CC2IE         (0x1U<<2)
#define TIM1_DIER_CC3IE         (0x1U<<3)
#define TIM1_DIER_CC4IE         (0x1U<<4)
#define TIM1_DIER_COMIE         (0x1U<<5)
#define TIM1_DIER_TIE           (0x1U<<6)
#define TIM1_DIER_BIE           (0x1U<<7)
#define TIM1_DIER_UDE           (0x1U<<8)
#define TIM1_DIER_CC1DE         (0x1U<<9)
#define TIM1_DIER_CC2DE         (0x1U<<10)
#define TIM1_DIER_CC3DE         (0x1U<<11)
#define TIM1_DIER_CC4DE         (0x1U<<12)
#define TIM1_DIER_COMDE         (0x1U<<13)
#define TIM1_DIER_TDE           (0x1U<<14)
#define TIM1_DIER_IDXIE         (0x1U<<20)
#define TIM1_DIER_DIRIE         (0x1U<<21)
#define TIM1_DIER_IERRIE        (0x1U<<22)
#define TIM1_DIER_TERRIE        (0x1U<<23)

// SR Configuration

#define TIM1_SR_UIF             (0x1U<<0)
#define TIM1_SR_CC1IF           (0x1U<<1)
#define TIM1_SR_CC2IF           (0x1U<<2)
#define TIM1_SR_CC3IF           (0x1U<<3)
#define TIM1_SR_CC4IF           (0x1U<<4)
#define TIM1_SR_COMIF           (0x1U<<5)
#define TIM1_SR_TIF             (0x1U<<6)
#define TIM1_SR_BIF             (0x1U<<7)
#define TIM1_SR_B2IF            (0x1U<<8)
#define TIM1_SR_CC1OF           (0x1U<<9)
#define TIM1_SR_CC2OF           (0x1U<<10)
#define TIM1_SR_CC3OF           (0x1U<<11)
#define TIM1_SR_CC4OF           (0x1U<<12)
#define TIM1_SR_SBIF            (0x1U<<13)
#define TIM1_SR_CC5IF           (0x1U<<16)
#define TIM1_SR_CC6IF           (0x1U<<17)
#define TIM1_SR_IDXF            (0x1U<<20)
#define TIM1_SR_DIRF            (0x1U<<21)
#define TIM1_SR_IERRF           (0x1U<<22)
#define TIM1_SR_TERRF           (0x1U<<23)

// EGR Configuration

#define TIM1_EGR_UG             (0x1U<<0)
#define TIM1_EGR_CC1G           (0x1U<<1)
#define TIM1_EGR_CC2G           (0x1U<<2)
#define TIM1_EGR_CC3G           (0x1U<<3)
#define TIM1_EGR_CC4G           (0x1U<<4)
#define TIM1_EGR_COMG           (0x1U<<5)
#define TIM1_EGR_TG             (0x1U<<6)
#define TIM1_EGR_BG             (0x1U<<7)
#define TIM1_EGR_B2G            (0x1U<<8)

// CCMR1 Configuration

#define TIM1_CCMR1_CC1S         (0x3U<<0)
#define TIM1_CCMR1_CC1S_0       (0x1U<<0)
#define TIM1_CCMR1_OC1FE        (0x1U<<2)
#define TIM1_CCMR1_OC1PE        (0x1U<<3)
#define TIM1_CCMR1_OC1M         (0x7U<<4)
#define TIM1_CCMR1_OC1M_0       (0x1U<<4)
#define TIM1_CCMR1_OC1CE        (0x1U<<7)
#define TIM1_CCMR1_CC2S         (0x3U<<8)
#define TIM1_CCMR1_CC2S_0       (0x1U<<8)
#define TIM1_CCMR1_OC2FE        (0x1U<<10)
#define TIM1_CCMR1_OC2PE        (0x1U<<11)
#define TIM1_CCMR1_OC2M         (0x7U<<12)
#define TIM1_CCMR1_OC2M_0       (0x1U<<12)
#define TIM1_CCMR1_OC2CE        (0x1U<<15)
#define TIM1_CCMR1_OC1M_BIT3    (0x1U<<16)
#define TIM1_CCMR1_OC2M_BIT3    (0x1U<<24)

// CCMR2 Configuration

#define TIM1_CCMR2_CC3S_1_0     (0x3U<<0)
#define TIM1_CCMR2_CC3S_1_0_0   (0x1U<<0)
#define TIM1_CCMR2_OC3FE        (0x1U<<2)
#define TIM1_CCMR2_OC3PE        (0x1U<<3)
#define TIM1_CCMR2_OC3M_2_0     (0x7U<<4)
#define TIM1_CCMR2_OC3M_2_0_0   (0x1U<<4)
#define TIM1_CCMR2_OC3CE        (0x1U<<7)
#define TIM1_CCMR2_CC4S_1_0     (0x3U<<8)
#define TIM1_CCMR2_CC4S_1_0_0   (0x1U<<8)
#define TIM1_CCMR2_OC4FE        (0x1U<<10)
#define TIM1_CCMR2_OC4PE        (0x1U<<11)
#define TIM1_CCMR2_OC4M_3_0     (0x7U<<12)
#define TIM1_CCMR2_OC4M_3_0_0   (0x1U<<12)
#define TIM1_CCMR2_OC4CE        (0x1U<<15)
#define TIM1_CCMR2_OC3M_3       (0x1U<<16)
#define TIM1_CCMR2_OC4M_BIT3    (0x1U<<24)

// CCER Configuration

#define TIM1_CCER_CC1E          (0x1U<<0)
#define TIM1_CCER_CC1P          (0x1U<<1)
#define TIM1_CCER_CC1NE         (0x1U<<2)
#define TIM1_CCER_CC1NP         (0x1U<<3)
#define TIM1_CCER_CC2E          (0x1U<<4)
#define TIM1_CCER_CC2P          (0x1U<<5)
#define TIM1_CCER_CC2NE         (0x1U<<6)
#define TIM1_CCER_CC2NP         (0x1U<<7)
#define TIM1_CCER_CC3E          (0x1U<<8)
#define TIM1_CCER_CC3P          (0x1U<<9)
#define TIM1_CCER_CC3NE         (0x1U<<10)
#define TIM1_CCER_CC3NP         (0x1U<<11)
#define TIM1_CCER_CC4E          (0x1U<<12)
#define TIM1_CCER_CC4P          (0x1U<<13)
#define TIM1_CCER_CC4NP         (0x1U<<15)
#define TIM1_CCER_CC5E          (0x1U<<16)
#define TIM1_CCER_CC5P          (0x1U<<17)
#define TIM1_CCER_CC6E          (0x1U<<20)
#define TIM1_CCER_CC6P          (0x1U<<21)

// CNT Configuration

#define TIM1_CNT_CNT            (0xFFFFU<<0)
#define TIM1_CNT_CNT_0          (0x1U<<0)
#define TIM1_CNT_UIFCPY         (0x1U<<31)

// PSC Configuration

#define TIM1_PSC_PSC            (0xFFFFU<<0)
#define TIM1_PSC_PSC_0          (0x1U<<0)

// ARR Configuration

#define TIM1_ARR_ARR            (0xFFFFFU<<0)
#define TIM1_ARR_ARR_0          (0x1U<<0)

// RCR Configuration

#define TIM1_RCR_REP            (0xFFFFU<<0)
#define TIM1_RCR_REP_0          (0x1U<<0)

// CCR1 Configuration

#define TIM1_CCR1_CCR1          (0xFFFFFU<<0)
#define TIM1_CCR1_CCR1_0        (0x1U<<0)

// CCR2 Configuration

#define TIM1_CCR2_CCR2          (0xFFFFFU<<0)
#define TIM1_CCR2_CCR2_0        (0x1U<<0)

// CCR3 Configuration

#define TIM1_CCR3_CCR3          (0xFFFFFU<<0)
#define TIM1_CCR3_CCR3_0        (0x1U<<0)

// CCR4 Configuration

#define TIM1_CCR4_CCR4          (0xFFFFFU<<0)
#define TIM1_CCR4_CCR4_0        (0x1U<<0)

// BDTR Configuration

#define TIM1_BDTR_DTG           (0xFFU<<0)
#define TIM1_BDTR_DTG_0         (0x1U<<0)
#define TIM1_BDTR_LOCK          (0x3U<<8)
#define TIM1_BDTR_LOCK_0        (0x1U<<8)
#define TIM1_BDTR_OSSI          (0x1U<<10)
#define TIM1_BDTR_OSSR          (0x1U<<11)
#define TIM1_BDTR_BKE           (0x1U<<12)
#define TIM1_BDTR_BKP           (0x1U<<13)
#define TIM1_BDTR_AOE           (0x1U<<14)
#define TIM1_BDTR_MOE           (0x1U<<15)
#define TIM1_BDTR_BKF           (0xFU<<16)
#define TIM1_BDTR_BKF_0         (0x1U<<16)
#define TIM1_BDTR_BK2F          (0xFU<<20)
#define TIM1_BDTR_BK2F_0        (0x1U<<20)
#define TIM1_BDTR_BK2E          (0x1U<<24)
#define TIM1_BDTR_BK2P          (0x1U<<25)
#define TIM1_BDTR_BKDSRM        (0x1U<<26)
#define TIM1_BDTR_BK2DSRAM      (0x1U<<27)
#define TIM1_BDTR_BKBID         (0x1U<<28)
#define TIM1_BDTR_BK2BID        (0x1U<<29)

// CCR5 Configuration

#define TIM1_CCR5_GC5C3         (0x1U<<31)
#define TIM1_CCR5_GC5C2         (0x1U<<30)
#define TIM1_CCR5_GC5C1         (0x1U<<29)
#define TIM1_CCR5_CCR5          (0xFFFFFU<<0)
#define TIM1_CCR5_CCR5_0        (0x1U<<0)

// CCR6 Configuration

#define TIM1_CCR6_CCR6          (0xFFFFFU<<0)
#define TIM1_CCR6_CCR6_0        (0x1U<<0)

// CCMR3 Configuration

#define TIM1_CCMR3_OC6M         (0x1U<<24)
#define TIM1_CCMR3_OC5M2        (0x1U<<16)
#define TIM1_CCMR3_OC6CE        (0x1U<<15)
#define TIM1_CCMR3_OC6M1        (0x7U<<12)
#define TIM1_CCMR3_OC6M1_0      (0x1U<<12)
#define TIM1_CCMR3_OC6PE        (0x1U<<11)
#define TIM1_CCMR3_OC6FE        (0x1U<<10)
#define TIM1_CCMR3_OC5CE        (0x1U<<7)
#define TIM1_CCMR3_OC5M1        (0x7U<<4)
#define TIM1_CCMR3_OC5M1_0      (0x1U<<4)
#define TIM1_CCMR3_OC5PE        (0x1U<<3)
#define TIM1_CCMR3_OC5FE        (0x1U<<2)

// DTR2 Configuration

#define TIM1_DTR2_DTGF          (0xFFU<<0)
#define TIM1_DTR2_DTGF_0        (0x1U<<0)
#define TIM1_DTR2_DTAE          (0x1U<<16)
#define TIM1_DTR2_DTPE          (0x1U<<17)

// ECR Configuration

#define TIM1_ECR_IE             (0x1U<<0)
#define TIM1_ECR_IDIR           (0x3U<<1)
#define TIM1_ECR_IDIR_0         (0x1U<<1)
#define TIM1_ECR_FIDX           (0x1U<<5)
#define TIM1_ECR_IPOS           (0x3U<<6)
#define TIM1_ECR_IPOS_0         (0x1U<<6)
#define TIM1_ECR_PW             (0xFFU<<16)
#define TIM1_ECR_PW_0           (0x1U<<16)
#define TIM1_ECR_PWPRSC         (0x7U<<24)
#define TIM1_ECR_PWPRSC_0       (0x1U<<24)

// TISEL Configuration

#define TIM1_TISEL_TI1SEL       (0xFU<<0)
#define TIM1_TISEL_TI1SEL_0     (0x1U<<0)
#define TIM1_TISEL_TI2SEL       (0xFU<<8)
#define TIM1_TISEL_TI2SEL_0     (0x1U<<8)
#define TIM1_TISEL_TI3SEL       (0xFU<<16)
#define TIM1_TISEL_TI3SEL_0     (0x1U<<16)
#define TIM1_TISEL_TI4SEL       (0xFU<<24)
#define TIM1_TISEL_TI4SEL_0     (0x1U<<24)

// AF1 Configuration

#define TIM1_AF1_BKINE          (0x1U<<0)
#define TIM1_AF1_BKCMP1E        (0x1U<<1)
#define TIM1_AF1_BKCMP2E        (0x1U<<2)
#define TIM1_AF1_BKCMP3E        (0x1U<<3)
#define TIM1_AF1_BKCMP4E        (0x1U<<4)
#define TIM1_AF1_BKCMP5E        (0x1U<<5)
#define TIM1_AF1_BKCMP6E        (0x1U<<6)
#define TIM1_AF1_BKCMP7E        (0x1U<<7)
#define TIM1_AF1_BKCMP8E        (0x1U<<8)
#define TIM1_AF1_BKINP          (0x1U<<9)
#define TIM1_AF1_BKCMP1P        (0x1U<<10)
#define TIM1_AF1_BKCMP2P        (0x1U<<11)
#define TIM1_AF1_BKCMP3P        (0x1U<<12)
#define TIM1_AF1_BKCMP4P        (0x1U<<13)
#define TIM1_AF1_ETRSEL         (0xFU<<14)
#define TIM1_AF1_ETRSEL_0       (0x1U<<14)

// AF2 Configuration

#define TIM1_AF2_BK2INE         (0x1U<<0)
#define TIM1_AF2_BK2CMP1E       (0x1U<<1)
#define TIM1_AF2_BK2CMP2E       (0x1U<<2)
#define TIM1_AF2_BK2CMP3E       (0x1U<<3)
#define TIM1_AF2_BK2CMP4E       (0x1U<<4)
#define TIM1_AF2_BK2CMP5E       (0x1U<<5)
#define TIM1_AF2_BK2CMP6E       (0x1U<<6)
#define TIM1_AF2_BK2CMP7E       (0x1U<<7)
#define TIM1_AF2_BK2CMP8E       (0x1U<<8)
#define TIM1_AF2_BK2INP         (0x1U<<9)
#define TIM1_AF2_BK2CMP1P       (0x1U<<10)
#define TIM1_AF2_BK2CMP2P       (0x1U<<11)
#define TIM1_AF2_BK2CMP3P       (0x1U<<12)
#define TIM1_AF2_BK2CMP4P       (0x1U<<13)
#define TIM1_AF2_OCRSEL         (0x7U<<16)
#define TIM1_AF2_OCRSEL_0       (0x1U<<16)

// DCR Configuration

#define TIM1_DCR_DBA            (0x1FU<<0)
#define TIM1_DCR_DBA_0          (0x1U<<0)
#define TIM1_DCR_DBL            (0x1FU<<8)
#define TIM1_DCR_DBL_0          (0x1U<<8)
#define TIM1_DCR_DBSS           (0xFU<<16)
#define TIM1_DCR_DBSS_0         (0x1U<<16)

// DMAR Configuration

#define TIM1_DMAR_DMAB          (0xFFFFFFFFU<<0)
#define TIM1_DMAR_DMAB_0        (0x1U<<0)
